---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.SetValue(Autodesk.Revit.DB.ElementId)
source: html/768e344c-4e15-866f-4cb1-84fe74d549d3.htm
---
# Autodesk.Revit.DB.ScheduleFilter.SetValue Method

Set the filter value to an ElementId.

## Syntax (C#)
```csharp
public void SetValue(
	ElementId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.ElementId`) - The filter value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null